'''函数定义'''
def fun(arg1,arg2):
    print('arg1=',arg1)
    print('arg2=', arg2)
    print('=======================')
    arg1=100
    arg2.append(100)
    print('=======================')
    print('arg1=', arg1)
    print('arg2=', arg2)


'''函数调用'''
n1=10
n2=[1,2,3]
print('n1=', n1)
print('n2=', n2)
print('=======================')
fun(n1,n2)
print('=======================')
print('n1=', n1)
print('n2=', n2)


'''
结果分析：
在函数的调用过程中，
如果是不可变对象，在函数体修改，不会影响实参的值；arg1修改10，不会影响n1的值
如果是可变对象，在桉树体内修改，会影响实参的值；arg2的修改会影响n2的值
'''