s="Hello,Python"
print('=====================1.居中center=====================')
print(s)
print(s.center(20,'*'))
print(s.center(20))#填充符默认为空格
'''
1.第一参数为宽度，第二参数为填充符号
2.第一个参数宽度小于原字符长度，原样式输出
3.第二个参数填充符不写，默认为空格
'''
print(s.center(10,'*'))#第一个参数宽度小于原字符长度，原样式输出

print('=====================2.左对齐ljust=====================')
print(s.ljust(20,'*'))
print(s.ljust(10,'*'))

print('=====================3.右对齐rjust=====================')
print(s.rjust(20,'*'))
print(s.rjust(10,'*'))

print('=====================4.右对齐zfill=====================')
'''
右对齐，只有与一个人参数指定宽度，值使用0填充
'''
print(s.zfill(20)) #只填充0
print(s.zfill(10)) #宽度小于原字符，原样输出

print('-12345'.zfill(8))  #会在-符号后面添加填充字符

