#1.使用{}创建
print('=====================1.使用{}创建=====================')
s={1,2,3,4,5,5,2,3}
print(s)
'''
由输出的结果得知，集合是和字典底层一样的数据结构，不能重复，而且四无序的
字典中是键不能重复
集合中是值不能重复，会把重复的去掉
'''

#2.使用Set()创建
print('=====================2.使用Set()创建=====================')
s1=set(range(6))
print(s1,type(s1))

s2=set([8,5,3,6,8,6]) #列表
print(s2,type(s2))

s3=set((8,5,3,6,8,5)) #元组
print(s3,type(s3))

s4=set(('Python')) #字符串
print(s4,type(s4))

s5=set({8,5,3,6,8,5}) #字符串
print(s5,type(s5))

#定义一个空集合
s6={}  #定义的不是集合哦，类型是字典，不是集合
print(s6,type(s6))

s7=set()
print(s7,type(s7))