s={10,20,3,0,40,50,90,100}
#1.判断存在操作
print('=====================1.判断存在操作=====================')
print(10 in s)
print(100 not in s)
#2.新增
print('=====================2.新增元素=====================')
#add：一次添加一个
s.add(80)
print(s)

#update：一次添加一个或者多个
s.update({1000,200,300})
print(s)

s.update([101,102,103]) #列表
s.update((201,202,203)) #元组
print(s)

#3.删除
print('=====================3.删除元素=====================')
#remove
s.remove(100)
print(s)
#s.remove(520)#不存在元素，则抛出异常

#discard
s.discard(520)  #不存在则不会抛出异常

#pop ：删除一个元素，但是任意的，不确定删除哪一个
s.pop()
#s.pop()   #不能添加参数，添加参数，抛出异常
print(s)

#clear :清空集合内容
s.clear()
print(s)