s1={10,20,30}
s2={30,20,10}

print(id(s1))
print(id(s2))

print('=====================1.集合是否相等=====================')
print(s1==s2) #集合是无序的，顺序不影响集合的等值关系
'''
元素相同就相等
'''

print('=====================2.集合子集=====================')
s1={10,20,30}
s2={30,20,40,50}
s3={0,30,20,10,40,50}

print(s2.issubset(s3))
print(s1.issubset(s2))

print('=====================3.集合超集=====================')
'''
子集和超集是相反的
'''

print(s2.issuperset(s1))
print(s3.issuperset(s2))

print('=====================4.集合是否存在交集=====================')
'''
存在交集为True
不存在交集为False
'''
print(s2.isdisjoint(s1))  #存在交集，为False

s4={801}
print(s2.isdisjoint(s4))  #不存在交集，为True