s1={10,20,30,40,50,60,70,80}
s2={10,30,50,70,90}
print('=====================1.交集=====================')
print(s1.intersection(s2))
print(s1 & s2)  #& 在Python中是取交集操作

print('=====================2.并集=====================')
print(s1.union(s2))
print(s1 | s2)  #| 在Python中是取并集操作

print(s1)
print(s2)
'''
原集合的值并不发生变化
'''
print('=====================3.差集=====================')
print((s1.difference(s2)))
print((s1-s2))  #对应键盘的减号

print('=====================4.对称差集=====================')
print(s1.symmetric_difference(s2))
print(s1 ^ s2)  #对应键盘上^，（6的对应fuhao）